import { H1, P, H2, Ol } from "@/components/ArticleParts";

export default function TeamOfUse() {
  return (
    <>
      <H1>利用規約 </H1>
      <P>
        この利用規約（以下、「本規約」といいます。）は、運営者がこのウェブサイト上で提供するサービス（以下、「本サービス」といいます。）の利用条件を定めるものです。ユーザーの皆さま（以下、「ユーザー」といいます。）には、本規約に従って、本サービスをご利用いただきます。
      </P>
      <H2>第 1 条（適用） </H2>
      <Ol>
        <li>
          本規約は、ユーザーと本サービスの利用に関わる一切の関係に適用されるものとします。
        </li>
        <li>
          本サービスに関し、本規約のほか、ご利用にあたってのルール等、各種の定め（以下、「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず、本規約の一部を構成するものとします。
        </li>
        <li>
          本規約の規定が前条の個別規定の規定と矛盾する場合には、個別規定において特段の定めなき限り、個別規定の規定が優先されるものとします。
        </li>
      </Ol>
      <H2>第 2 条（利用をお断りする場合） </H2>
      <P>
        本サービスは、利用をリクエストした者に以下の事由があると判断した場合、利用を承認しないことがあり、その理由については一切の開示義務を負わないものとします。
      </P>
      <Ol>
        <li>本規約に違反したことがある者からのリクエストである場合</li>
        <li>その他、本サービスが利用を相当でないと判断した場合</li>
      </Ol>
      <H2>第 3 条（禁止事項） </H2>
      <P>
        ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。
      </P>
      <Ol>
        <li>法令または公序良俗に違反する行為</li>
        <li>犯罪行為に関連する行為</li>
        <li>
          運営者、本サービスの他のユーザー、または第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為
        </li>
        <li>運営者のサービスの運営を妨害するおそれのある行為</li>
        <li>他のユーザーに関する個人情報等を収集または蓄積する行為</li>
        <li>不正アクセスをし、またはこれを試みる行為</li>
        <li>他のユーザーに成りすます行為</li>
        <li>
          運営者のサービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為
        </li>
        <li>
          運営者、本サービスの他のユーザーまたは第三者の知的財産権、肖像権、プライバシー、名誉その他の権利または利益を侵害する行為
        </li>
        <li>Tor などのツールにより通信を匿名化する行為</li>
        <li>
          以下の表現を含み、または含むと運営者が判断する内容を送信する行為
          <Ol>
            <li>過度に暴力的な表現</li>
            <li>露骨な性的表現</li>
            <li>
              人種、国籍、信条、性別、社会的身分、門地等による差別につながる表現
            </li>
            <li>自殺、自傷行為、薬物乱用を誘引または助長する表現</li>
            <li>その他反社会的な内容を含み他人に不快感を与える表現</li>
          </Ol>
        </li>
        <li>
          以下を目的とし、または目的とすると運営者が判断する行為
          <Ol>
            <li>営業、宣伝、広告、勧誘、その他営利を目的とする行為</li>
            <li>性行為やわいせつな行為を目的とする行為</li>
            <li>面識のない異性との出会いや交際を目的とする行為</li>
            <li>他のユーザーに対する嫌がらせや誹謗中傷を目的とする行為</li>
            <li>
              運営者、本サービスの他のユーザー、または第三者に不利益、損害または不快感を与えることを目的とする行為
            </li>
            <li>
              その他本サービスが予定している利用目的と異なる目的で本サービスを利用する行為
            </li>
            <li>宗教活動または宗教団体への勧誘行為</li>
            <li>その他、運営者が不適切と判断する行為</li>
          </Ol>
        </li>
      </Ol>
      <H2>第 4 条（本サービスの提供の停止等） </H2>
      <P>
        運営者は、以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
      </P>
      <Ol>
        <li>
          本サービスにかかるコンピュータシステムの保守点検または更新を行う場合
        </li>
        <li>
          ホスティングサービスの停止や制限などの不可抗力により、本サービスの提供が困難となった場合
        </li>
        <li>その他、本サービスの提供が困難と判断した場合</li>
      </Ol>
      <P>
        運営者は、本サービスの提供の停止または中断により、ユーザーまたは第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。
      </P>
      <H2>第 5 条（利用制限） </H2>
      <P>
        運営者は、ユーザーが以下のいずれかに該当する場合には、事前の通知なく、ユーザーに対して本サービスの全部もしくは一部の利用を制限することができるものとします。
      </P>
      <Ol>
        <li>本規約のいずれかの条項に違反した場合</li>
        <li>その他、運営者が本サービスの利用を適当でないと判断した場合</li>
      </Ol>
      <P>
        運営者は、本条に基づき運営者が行った行為によりユーザーに生じた損害について、一切の責任を負いません。
      </P>
      <H2>第 6 条（保証の否認および免責事項） </H2>
      <Ol>
        <li>
          運営者は、本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
        </li>
        <li>
          運営者は、本サービスに関して、ユーザーと他のユーザーまたは第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。
        </li>
      </Ol>
      <H2>第 7 条（利用規約の変更） </H2>
      <Ol>
        <li>
          本規約の内容は、法令その他本規約に別段の定めのある事項を除いて、本ウェブサイト上で告知することにより、変更することができるものとします。
        </li>
        <li>
          運営者が別途定める場合を除いて、変更後の本規約は、本ウェブサイトに掲載したときから効力を生じるものとします。
        </li>
      </Ol>
      <H2>第 8 条（準拠法・裁判管轄） </H2>
      <Ol>
        <li>本規約の解釈にあたっては、日本法を準拠法とします。</li>
        <li>
          本サービスに関して紛争が生じた場合には、運営者の拠点を管轄する裁判所を専属的合意管轄とします。
        </li>
      </Ol>
      <P>以上</P>
      <P>UTC {process.env.NEXT_PUBLIC_TEAMS_OF_USE_CHANGED} 制定</P>
    </>
  );
}
